#![allow(warnings)] 
/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {

    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn rawmemchr(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memrchr(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::std::mem::MaybeUninit<__locale_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *mut ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *mut ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchrnul(
        __s: *mut ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> usize;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> usize;
}
extern "C" {
    pub fn strpbrk(
        __s: *mut ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *mut ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcasestr(
        __haystack: *mut ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn memmem(
        __haystack: *const ::std::os::raw::c_void,
        __haystacklen: usize,
        __needle: *const ::std::os::raw::c_void,
        __needlelen: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn __mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> usize;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerrordesc_np(__err: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerrorname_np(__err: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: usize,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn sigabbrev_np(__sig: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn sigdescr_np(__sig: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strverscmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfry(__string: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn memfrob(__s: *mut ::std::os::raw::c_void, __n: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn basename(__filename: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
extern "C" {
    #[link_name = "\u{1}_ZL27WLAN_IEEE_HEADER_AIR2GROUND"]
    pub static WLAN_IEEE_HEADER_AIR2GROUND: [u8; 24usize];
}
extern "C" {
    #[link_name = "\u{1}_ZL27WLAN_IEEE_HEADER_GROUND2AIR"]
    pub static WLAN_IEEE_HEADER_GROUND2AIR: [u8; 24usize];
}
pub const WLAN_IEEE_HEADER_SIZE: usize = 24;
pub const WLAN_MAX_PACKET_SIZE: usize = 1500;
pub const WLAN_MAX_PAYLOAD_SIZE: usize = 1476;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Wlan_Outgoing_Packet {
    pub ptr: *mut u8,
    pub payload_ptr: *mut u8,
    pub size: u16,
    pub offset: u16,
}
#[test]
fn bindgen_test_layout_Wlan_Outgoing_Packet() {
    const UNINIT: ::std::mem::MaybeUninit<Wlan_Outgoing_Packet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Wlan_Outgoing_Packet>(),
        24usize,
        concat!("Size of: ", stringify!(Wlan_Outgoing_Packet))
    );
    assert_eq!(
        ::std::mem::align_of::<Wlan_Outgoing_Packet>(),
        8usize,
        concat!("Alignment of ", stringify!(Wlan_Outgoing_Packet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Wlan_Outgoing_Packet),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).payload_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Wlan_Outgoing_Packet),
            "::",
            stringify!(payload_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Wlan_Outgoing_Packet),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Wlan_Outgoing_Packet),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Wlan_Incoming_Packet {
    pub ptr: *mut u8,
    pub size: u16,
    pub offset: u16,
}
#[test]
fn bindgen_test_layout_Wlan_Incoming_Packet() {
    const UNINIT: ::std::mem::MaybeUninit<Wlan_Incoming_Packet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Wlan_Incoming_Packet>(),
        16usize,
        concat!("Size of: ", stringify!(Wlan_Incoming_Packet))
    );
    assert_eq!(
        ::std::mem::align_of::<Wlan_Incoming_Packet>(),
        8usize,
        concat!("Alignment of ", stringify!(Wlan_Incoming_Packet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Wlan_Incoming_Packet),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Wlan_Incoming_Packet),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Wlan_Incoming_Packet),
            "::",
            stringify!(offset)
        )
    );
}
pub const WIFI_Rate_RATE_B_2M_CCK: WIFI_Rate = 0;
pub const WIFI_Rate_RATE_B_2M_CCK_S: WIFI_Rate = 1;
pub const WIFI_Rate_RATE_B_5_5M_CCK: WIFI_Rate = 2;
pub const WIFI_Rate_RATE_B_5_5M_CCK_S: WIFI_Rate = 3;
pub const WIFI_Rate_RATE_B_11M_CCK: WIFI_Rate = 4;
pub const WIFI_Rate_RATE_B_11M_CCK_S: WIFI_Rate = 5;
pub const WIFI_Rate_RATE_G_6M_ODFM: WIFI_Rate = 6;
pub const WIFI_Rate_RATE_G_9M_ODFM: WIFI_Rate = 7;
pub const WIFI_Rate_RATE_G_12M_ODFM: WIFI_Rate = 8;
pub const WIFI_Rate_RATE_G_18M_ODFM: WIFI_Rate = 9;
pub const WIFI_Rate_RATE_G_24M_ODFM: WIFI_Rate = 10;
pub const WIFI_Rate_RATE_G_36M_ODFM: WIFI_Rate = 11;
pub const WIFI_Rate_RATE_G_48M_ODFM: WIFI_Rate = 12;
pub const WIFI_Rate_RATE_G_54M_ODFM: WIFI_Rate = 13;
pub const WIFI_Rate_RATE_N_6_5M_MCS0: WIFI_Rate = 14;
pub const WIFI_Rate_RATE_N_7_2M_MCS0_S: WIFI_Rate = 15;
pub const WIFI_Rate_RATE_N_13M_MCS1: WIFI_Rate = 16;
pub const WIFI_Rate_RATE_N_14_4M_MCS1_S: WIFI_Rate = 17;
pub const WIFI_Rate_RATE_N_19_5M_MCS2: WIFI_Rate = 18;
pub const WIFI_Rate_RATE_N_21_7M_MCS2_S: WIFI_Rate = 19;
pub const WIFI_Rate_RATE_N_26M_MCS3: WIFI_Rate = 20;
pub const WIFI_Rate_RATE_N_28_9M_MCS3_S: WIFI_Rate = 21;
pub const WIFI_Rate_RATE_N_39M_MCS4: WIFI_Rate = 22;
pub const WIFI_Rate_RATE_N_43_3M_MCS4_S: WIFI_Rate = 23;
pub const WIFI_Rate_RATE_N_52M_MCS5: WIFI_Rate = 24;
pub const WIFI_Rate_RATE_N_57_8M_MCS5_S: WIFI_Rate = 25;
pub const WIFI_Rate_RATE_N_58M_MCS6: WIFI_Rate = 26;
pub const WIFI_Rate_RATE_N_65M_MCS6_S: WIFI_Rate = 27;
pub const WIFI_Rate_RATE_N_65M_MCS7: WIFI_Rate = 28;
pub const WIFI_Rate_RATE_N_72M_MCS7_S: WIFI_Rate = 29;
pub type WIFI_Rate = u8;
pub const AIR2GROUND_MTU: usize = 1470;
pub const GROUND2AIR_DATA_MAX_SIZE: usize = 64;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Ground2Air_Header {
    pub type_: Ground2Air_Header_Type,
    pub size: u32,
    pub crc: u8,
}
pub const Ground2Air_Header_Type_Data: Ground2Air_Header_Type = 0;
pub const Ground2Air_Header_Type_Config: Ground2Air_Header_Type = 1;
pub type Ground2Air_Header_Type = u8;
#[test]
fn bindgen_test_layout_Ground2Air_Header() {
    const UNINIT: ::std::mem::MaybeUninit<Ground2Air_Header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Ground2Air_Header>(),
        6usize,
        concat!("Size of: ", stringify!(Ground2Air_Header))
    );
    assert_eq!(
        ::std::mem::align_of::<Ground2Air_Header>(),
        1usize,
        concat!("Alignment of ", stringify!(Ground2Air_Header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Header),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Header),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).crc) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Header),
            "::",
            stringify!(crc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Ground2Air_Data_Packet {
    pub _base: Ground2Air_Header,
}
#[test]
fn bindgen_test_layout_Ground2Air_Data_Packet() {
    assert_eq!(
        ::std::mem::size_of::<Ground2Air_Data_Packet>(),
        6usize,
        concat!("Size of: ", stringify!(Ground2Air_Data_Packet))
    );
    assert_eq!(
        ::std::mem::align_of::<Ground2Air_Data_Packet>(),
        1usize,
        concat!("Alignment of ", stringify!(Ground2Air_Data_Packet))
    );
}
pub const Resolution_QVGA: Resolution = 0;
pub const Resolution_CIF: Resolution = 1;
pub const Resolution_HVGA: Resolution = 2;
pub const Resolution_VGA: Resolution = 3;
pub const Resolution_SVGA: Resolution = 4;
pub const Resolution_XGA: Resolution = 5;
pub const Resolution_SXGA: Resolution = 6;
pub const Resolution_UXGA: Resolution = 7;
pub type Resolution = u8;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Ground2Air_Config_Packet {
    pub _base: Ground2Air_Header,
    pub ping: u8,
    pub wifi_power: i8,
    pub wifi_rate: WIFI_Rate,
    pub fec_codec_k: u8,
    pub fec_codec_n: u8,
    pub fec_codec_mtu: u16,
    pub dvr_record: bool,
    pub camera: Ground2Air_Config_Packet_Camera,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Ground2Air_Config_Packet_Camera {
    pub resolution: Resolution,
    pub fps_limit: u8,
    pub quality: u8,
    pub brightness: i8,
    pub contrast: i8,
    pub saturation: i8,
    pub sharpness: i8,
    pub denoise: u8,
    pub special_effect: u8,
    pub awb: bool,
    pub awb_gain: bool,
    pub wb_mode: u8,
    pub aec: bool,
    pub aec2: bool,
    pub ae_level: i8,
    pub aec_value: u16,
    pub agc: bool,
    pub agc_gain: u8,
    pub gainceiling: u8,
    pub bpc: bool,
    pub wpc: bool,
    pub raw_gma: bool,
    pub lenc: bool,
    pub hmirror: bool,
    pub vflip: bool,
    pub dcw: bool,
}
#[test]
fn bindgen_test_layout_Ground2Air_Config_Packet_Camera() {
    const UNINIT: ::std::mem::MaybeUninit<Ground2Air_Config_Packet_Camera> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Ground2Air_Config_Packet_Camera>(),
        27usize,
        concat!("Size of: ", stringify!(Ground2Air_Config_Packet_Camera))
    );
    assert_eq!(
        ::std::mem::align_of::<Ground2Air_Config_Packet_Camera>(),
        1usize,
        concat!("Alignment of ", stringify!(Ground2Air_Config_Packet_Camera))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolution) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(resolution)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fps_limit) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(fps_limit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quality) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(quality)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).brightness) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(brightness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).contrast) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(contrast)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).saturation) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(saturation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sharpness) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(sharpness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).denoise) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(denoise)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).special_effect) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(special_effect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).awb) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(awb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).awb_gain) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(awb_gain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wb_mode) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(wb_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aec) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(aec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aec2) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(aec2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ae_level) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(ae_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aec_value) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(aec_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).agc) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(agc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).agc_gain) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(agc_gain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gainceiling) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(gainceiling)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bpc) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(bpc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wpc) as usize - ptr as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(wpc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).raw_gma) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(raw_gma)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lenc) as usize - ptr as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(lenc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hmirror) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(hmirror)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vflip) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(vflip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dcw) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet_Camera),
            "::",
            stringify!(dcw)
        )
    );
}
#[test]
fn bindgen_test_layout_Ground2Air_Config_Packet() {
    const UNINIT: ::std::mem::MaybeUninit<Ground2Air_Config_Packet> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Ground2Air_Config_Packet>(),
        41usize,
        concat!("Size of: ", stringify!(Ground2Air_Config_Packet))
    );
    assert_eq!(
        ::std::mem::align_of::<Ground2Air_Config_Packet>(),
        1usize,
        concat!("Alignment of ", stringify!(Ground2Air_Config_Packet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ping) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet),
            "::",
            stringify!(ping)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wifi_power) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet),
            "::",
            stringify!(wifi_power)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wifi_rate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet),
            "::",
            stringify!(wifi_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fec_codec_k) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet),
            "::",
            stringify!(fec_codec_k)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fec_codec_n) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet),
            "::",
            stringify!(fec_codec_n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fec_codec_mtu) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet),
            "::",
            stringify!(fec_codec_mtu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dvr_record) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet),
            "::",
            stringify!(dvr_record)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).camera) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(Ground2Air_Config_Packet),
            "::",
            stringify!(camera)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Air2Ground_Header {
    pub type_: Air2Ground_Header_Type,
    pub size: u32,
    pub pong: u8,
    pub crc: u8,
}
pub const Air2Ground_Header_Type_Video: Air2Ground_Header_Type = 0;
pub const Air2Ground_Header_Type_Telemetry: Air2Ground_Header_Type = 1;
pub type Air2Ground_Header_Type = u8;
#[test]
fn bindgen_test_layout_Air2Ground_Header() {
    const UNINIT: ::std::mem::MaybeUninit<Air2Ground_Header> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Air2Ground_Header>(),
        7usize,
        concat!("Size of: ", stringify!(Air2Ground_Header))
    );
    assert_eq!(
        ::std::mem::align_of::<Air2Ground_Header>(),
        1usize,
        concat!("Alignment of ", stringify!(Air2Ground_Header))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Air2Ground_Header),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Air2Ground_Header),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pong) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(Air2Ground_Header),
            "::",
            stringify!(pong)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).crc) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(Air2Ground_Header),
            "::",
            stringify!(crc)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct Air2Ground_Video_Packet {
    pub _base: Air2Ground_Header,
    pub resolution: Resolution,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub frame_index: u32,
}
#[test]
fn bindgen_test_layout_Air2Ground_Video_Packet() {
    const UNINIT: ::std::mem::MaybeUninit<Air2Ground_Video_Packet> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<Air2Ground_Video_Packet>(),
        13usize,
        concat!("Size of: ", stringify!(Air2Ground_Video_Packet))
    );
    assert_eq!(
        ::std::mem::align_of::<Air2Ground_Video_Packet>(),
        1usize,
        concat!("Alignment of ", stringify!(Air2Ground_Video_Packet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolution) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(Air2Ground_Video_Packet),
            "::",
            stringify!(resolution)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_index) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(Air2Ground_Video_Packet),
            "::",
            stringify!(frame_index)
        )
    );
}
impl Air2Ground_Video_Packet {
    #[inline]
    pub fn part_index(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_part_index(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn last_part(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_last_part(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(part_index: u8, last_part: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
